hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
/**HEADER*******************************************************************
  project : VdMot Controller
  author : Lenti84
  Comments:
  Version :
  Modifcations :
***************************************************************************
*
* THIS SOFTWARE IS PROVIDED "AS IS" AND ANY EXPRESSED OR
* IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
* OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL THE DEVELOPER OR ANY CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
* INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
* SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
* HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
* STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
* IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
* THE POSSIBILITY OF SUCH DAMAGE.
*
**************************************************************************
  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License.
  See the GNU General Public License for more details.
  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
  Copyright (C) 2021 Lenti84  https://github.com/Lenti84/VdMot_Controller
*END************************************************************************/

#include <Arduino.h>
#include <Wire.h>
#include "motor.h"
#include "hardware.h"
#include "STM32TimerInterrupt.h"      // library https://github.com/khoih-prog/STM32_TimerInterrupt
#include "terminal.h"
#include "app.h"
#include "eeprom.h"
#include "owDevices.h"
#include "vdm/end_stop_detector.h"
#include "vdm/presence_test.h"
#include "vdm/protection_guard.h"
#include "vdm/stall_detector.h"
#include "vdm/valve_codes.h"



//#define COMM_DBG				Serial3		// serial port for debugging
#define COMM_DBG				Serial6		// serial port for debugging


#define DIR_CLOSE      (int)  1
#define DIR_OPEN       (int)  0 

#define TIMER0_INTERVAL_MS        1

#define TIMEOUT_NORMALCURRENT    120*100      // 120 seconds timeout with 10 ms cycle time
#define TIMEOUT_OVERCURRENT      1            // cycles of "byte motorcycle (byte valvenr, byte cmd)"
#define TIMEOUT_UNDERCURRENT     4*50           // cycles of "byte motorcycle (byte valvenr, byte cmd)"
#define THRESHOLD_UNDERCURRENT   20           // threshold for detecting undercurrent in 1/10 mA
#define TIMEOUT_TURNON           10           // cycles of motorcycle() to wait for TimerHandler0 (1 ms) to enable the motor
#define TIMEOUT_VALVESTATE       5*60*100     // 5 minutes with 10 ms cycle time, more than the longest valve state (one move <= ~123 s)
#define TIMEOUT_TEMPGAP          300          // longest pause between two calibration strokes for a temperature cycle (3 s)


// commands motor statemachine
#define CMD_M_OPEN      'o'
#define CMD_M_CLOSE     'c'
#define CMD_M_STOP      's'
#define CMD_M_NOTHING   'n'
#define CMD_M_TEST      't'


// return values motor cycle
#define M_RES_INIT        1
#define M_RES_IDLE        2
#define M_RES_OPENS       3
#define M_RES_CLOSES      4
#define M_RES_TURNING     5
#define M_RES_ENDSTOP     6
#define M_RES_STOP        7
#define M_RES_NOCURRENT   9
#define M_RES_TEST        10
#define M_RES_ERROR       11

#define WAIT_TIMER100     2*100
#define WAIT_TIMER50      2*50
#define WAIT_TIMER20      2*20

void set_motor (int smvalvenr, int dir);
void ena_motor (int emvalvenr, int state);
static void ena_all_off ();
void isr_count ();
void callback_motorstop ();
byte motorcycle (int mvalvenr, byte cmd);
byte appcycle(byte cmd, byte valvenr);

void TimerHandler0();
static void motor_halt ();

#define MUX_SETTLE_TICKS  ((WAIT_MUX + 9) / 10)     // motorcycle() runs every 10 ms

// position arithmetic clamped to 0..100 %
static byte position_add (byte position, byte delta) {
  unsigned int sum = (unsigned int) position + delta;
  return sum > 100 ? 100 : (byte) sum;
}

static byte position_sub (byte position, byte delta) {
  return delta >= position ? 0 : (byte) (position - delta);
}

volatile enum ASTATE valvestate;
volatile uint32_t valve_loop_ticks;
volatile bool valve_loop_stalled;
static vdm::StallDetector valve_stall(TIMEOUT_VALVESTATE);

volatile bool temp_refresh_request = false;
volatile bool temp_gap_timeout;
volatile bool protect_suspended = false;
volatile bool protect_enforce = vdm::kProtectEnforce;
// sstop of the valve in work; cleared when the valve state machine is back in A_IDLE
static volatile bool stop_request;

// Init STM32 timer TIM1
STM32Timer ITimer0(TIM1);

//int counter;
//unsigned long time;
volatile int current_mA;                         // current valve motor in 1/10 mA for normal mode

volatile int analog_current;                     // current valve motor in 1/10 mA for test mode
volatile int analog_current_old;                 // filter memory



// unsigned int idlecurrent = 2048;        // idle current adc value (digits)
// unsigned int idlecurrent_old = 2048;    // filter

volatile unsigned int isr_counter;          // ISR var for counting revolutions
volatile byte         isr_turning;          // ISR var for state of motor
volatile unsigned int isr_target;           // ISR var for valve target count
volatile int          isr_valvenr;          // ISR var for valve nr
volatile byte         isr_timer_go;         // ISR var for timer pwm start
volatile byte         isr_timer_fin;        // ISR var for timer pwm finished

volatile byte         isr_overcurrentevent;
volatile byte         isr_stop_request;         // set by EXTI when the target count is reached

volatile valvemotor myvalvemots[ACTUATOR_COUNT];


// handoff main loop -> valve_loop (TIM2), written by appsetaction() with interrupts disabled
volatile char command = '\0';
volatile int valvenr;
volatile byte poschangecmd;
volatile uint8_t moveflagscmd;           // MOVE_KEEP_STATUS, MOVE_REFERENCE
volatile uint8_t svc_dir;                 // service move parameters, see appsetservice()
volatile uint16_t svc_counts;
volatile uint8_t svc_maxmA;

uint8_t currentbound_low_fac = 17;        // lower current limit factor for detection of end stop
uint8_t currentbound_high_fac = 17;       // upper current limit factor for detection of end stop

uint8_t startOnPower = 50;
uint16_t noOfMinCounts = NO_OF_MIN_COUNTS;
uint8_t maxCalibRetries;
uint8_t calibRetries;

// written by the main loop with interrupts disabled, read by valve_loop (TIM2)
static vdm::EscalationConfig calib_escalation = vdm::kEscalationDefault;

//volatile uint32_t revcounter;

static int undercurrcnt;

