hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
// end-stop detection, fed by TimerHandler0 (TIM1); armed and read by the motor state machine
// (TIM2). Both interrupts have the same priority and cannot preempt each other.
static vdm::EndStopDetector endstop;

// the move in progress (TIM2 context)
#define MOVE_NORMAL   0           // position change requested by app_loop (counts for early stops)
#define MOVE_LEARN    1           // calibration stroke
#define MOVE_SERVICE  2           // service move (svmov)

static vdm::MoveRequest move_req;
static uint8_t move_kind = MOVE_NORMAL;
static int32_t move_bound_low;            // end-stop bounds for the next motor start, 1/10 mA
static int32_t move_bound_high;
static uint32_t move_start_ms;
static vdm::MotorStop motor_stop_cause = vdm::MotorStop::None;
static int last_turning_current;          // current_mA at the last M_TURNING tick
static uint16_t stroke_mean_mA;           // mean current of the last stroke that ended at an end stop
static uint16_t stroke_mean_samples;
static vdm::ProfileRecorder move_profile;
static uint8_t move_flags;                // flags of the normal move in progress
static byte keep_status;                  // status a MOVE_KEEP_STATUS move restores
static byte pos_change;                   // requested change of the normal move in %, 255: to the end stop
static int waittimer;
static vdm::PresenceTest test_presence;   // M_TEST

#ifdef inrushDebug
// first 50 ms of every motor start (TimerHandler0): peak raw current and samples above the inrush limit
static volatile uint16_t inrush_samples = 0;
static volatile int32_t inrush_peak = 0;
static volatile uint16_t inrush_over = 0;
#endif

// per valve diagnostics; written by valve_loop (TIM2), read via valve_get_snapshot()/valve_get_profile()
struct valve_record {
  struct valve_diag diag;
  vdm::ProfileRecorder profile;
};
static struct valve_record valve_records[ACTUATOR_COUNT];

// drives the valve PSU and motor enable outputs to their inactive level;
// called right after reset, before the 3 s boot window
void valve_pins_safe () {
  // preset the output latch first: switching to open drain with the reset value LOW
  // would enable the valve PSU for a moment
  set_GPIO_Port_Clock(STM_PORT(digitalPinToPinName(POWER_ENA)));
  PSU_OFF();
  pinMode(POWER_ENA, OUTPUT_OPEN_DRAIN);
  PSU_OFF();

  // L293 enable inputs; PA15/PB3 are JTAG pins with pull resistors after reset
  pinMode(CTRL_ENA0, OUTPUT);
  pinMode(CTRL_ENA1, OUTPUT);
  pinMode(CTRL_ENA2, OUTPUT);
  pinMode(CTRL_ENA3, OUTPUT);
  pinMode(CTRL_ENA4, OUTPUT);
  pinMode(CTRL_ENA5, OUTPUT);
  ena_all_off();
}


// call from setup function in main, after app_setup() loaded the motor parameters
byte valve_setup () {

  // valve MUX relay
  pinMode(CTRL_MUX, OUTPUT);

  // L293 enable pins
  pinMode(CTRL_ENA0, OUTPUT);
  pinMode(CTRL_ENA1, OUTPUT);
  pinMode(CTRL_ENA2, OUTPUT);
  pinMode(CTRL_ENA3, OUTPUT);
  pinMode(CTRL_ENA4, OUTPUT);
  pinMode(CTRL_ENA5, OUTPUT);

  // L293 direction pin
  pinMode(CTRL_DIRECTION, OUTPUT); 

  // input for counting revs
  pinMode(REVINPIN, INPUT);

  // external interrupt for counting revs
  //attachInterrupt(digitalPinToInterrupt(REVINPIN),isr_counter,RISING);

  #ifdef motDebug
    COMM_DBG.print("Current end stop factor low: ");
    COMM_DBG.println((float) (currentbound_low_fac)/10,DEC);
    COMM_DBG.print("Current end stop factor high: ");
    COMM_DBG.println((float) (currentbound_high_fac)/10,DEC);
  #endif

// init valve data
  for (unsigned int x = 0;x<ACTUATOR_COUNT;x++) {
    myvalvemots[x].actual_position = startOnPower;
    myvalvemots[x].target_position = startOnPower;
    myvalvemots[x].meancurrent = vdm::kMeanCurrentDefault_mA;
    myvalvemots[x].scaler = 89;
    myvalvemots[x].calibRetries = 0;
    myvalvemots[x].calibActive = 0;
    myvalvemots[x].calibrated = 0;
    myvalvemots[x].recal = 0;
    myvalvemots[x].needsReference = 0;
    myvalvemots[x].calibSeq = 0;
    myvalvemots[x].calibFailed = 0;
    myvalvemots[x].earlyLearnDue = 0;
    myvalvemots[x].faultReason = (uint8_t) vdm::ValveFault::None;
    myvalvemots[x].moveSeq = 0;
    myvalvemots[x].tripSeq = 0;
  }

  valvestate = A_INIT;

  // Interval in microsecs
  if (ITimer0.attachInterruptInterval(TIMER0_INTERVAL_MS * 1000, TimerHandler0))
  {
    #ifdef motDebug 
        COMM_DBG.print(F("Starting ITimer0 OK, millis() = ")); COMM_DBG.println(millis());
    #endif
  }
  else {
    #ifdef motDebug
      COMM_DBG.println(F("Can't set ITimer0. Select another freq. or timer"));
    #endif
  }

 

  return 0;
}


vdm::MotorParams motor_get_params () {
  vdm::MotorParams p;
  p.lowFac = currentbound_low_fac;
  p.highFac = currentbound_high_fac;
  p.startOnPower = startOnPower;
  p.minCounts = noOfMinCounts;
  p.maxRetries = maxCalibRetries;
  return p;
}


// takes validated parameters into RAM and the EEPROM mirror (the caller decides about writing)
void motor_set_params (const vdm::MotorParams &params) {
  currentbound_low_fac = params.lowFac;
  currentbound_high_fac = params.highFac;
  startOnPower = params.startOnPower;
  noOfMinCounts = params.minCounts;
  maxCalibRetries = params.maxRetries;

  eep_content.currentbound_low_fac = params.lowFac;
  eep_content.currentbound_high_fac = params.highFac;
  eep_content.startOnPower = params.startOnPower;
  eep_content.noOfMinCounts = params.minCounts;
  eep_content.maxCalibRetries = params.maxRetries;
}


vdm::EscalationConfig motor_get_escalation () {
  return calib_escalation;
}


// takes a validated configuration into RAM and the EEPROM mirror
void motor_set_escalation (const vdm::EscalationConfig &config) {
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  calib_escalation = config;
  __set_PRIMASK(primask);
  eep_content.escalation = config;
}


void valve_get_snapshot (unsigned int valveindex, struct valve_snapshot &out) {
  if (valveindex >= ACTUATOR_COUNT) {
    out = valve_snapshot();
    return;
  }
  volatile valvemotor &mot = myvalvemots[valveindex];
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  out.diag = valve_records[valveindex].diag;
  out.opening_count = mot.opening_count;
  out.closing_count = mot.closing_count;
  out.deadzone_count = mot.deadzone_count;
  out.meancurrent = mot.meancurrent;
  out.movements = myvalves[valveindex].movements;
  out.status = mot.status;
  out.actual_position = mot.actual_position;
  out.target_position = mot.target_position;
  out.calibration = mot.calibration;
  out.calibRetries = mot.calibRetries;
  out.calibActive = mot.calibActive;
  __set_PRIMASK(primask);
}


