hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
void valve_get_profile (unsigned int valveindex, vdm::ProfileRecorder &out) {
  if (valveindex >= ACTUATOR_COUNT) {
    out.reset();
    return;
  }
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  out = valve_records[valveindex].profile;
  __set_PRIMASK(primask);
}


// full stroke of the last successful calibration in the direction of the move, 0 if unknown
static uint32_t learned_travel (int v, uint8_t dir) {
  const uint32_t travel = dir == DIR_OPEN ? myvalvemots[v].opening_count : myvalvemots[v].closing_count;
  return (myvalvemots[v].scaler > 0 && travel >= vdm::kMinTravelCounts) ? travel : 0;
}


// end-stop bounds from the learned mean current (S01: floor of at least 15 mA), optionally escalated
static void set_move_bounds (int v, uint16_t floor_mA, uint8_t repetition) {
  const uint16_t mean = (uint16_t) (myvalvemots[v].meancurrent > 0xFFFF ? 0xFFFF : myvalvemots[v].meancurrent);
  move_bound_high = vdm::escalatedBound(vdm::endStopBound(mean, currentbound_high_fac, floor_mA), repetition, calib_escalation);
  move_bound_low = -vdm::escalatedBound(vdm::endStopBound(mean, currentbound_low_fac, floor_mA), repetition, calib_escalation);
}


// prepares a position change by `change` % (255: to the end stop)
static void prepare_normal_move (int v, uint8_t dir, byte change) {
  uint16_t requested = vdm::kRunToEndStop;
  uint8_t expected = 0;

  if (change == 255) {
    // no early check when the start is not known (reference move) or the valve is failed or blocked
    if ((move_flags & (MOVE_REFERENCE | MOVE_KEEP_STATUS)) == 0) {
      const byte actual = myvalvemots[v].actual_position;
      expected = dir == DIR_OPEN ? (byte) (100 - (actual > 100 ? 100 : actual)) : actual;
    }
  }
  else {
    const uint32_t counts = (uint32_t) myvalvemots[v].scaler * change;
    requested = (uint16_t) (counts < vdm::kRunToEndStop ? counts : vdm::kRunToEndStop - 1);
  }

  isr_target = requested;
  move_req.dir = dir;
  move_req.requestedCounts = requested;
  move_req.expectedTravelPct = expected;
  move_req.learnedTravel = learned_travel(v, dir);
  move_req.partialEarlyCheck = change != 255 && (move_flags & MOVE_KEEP_STATUS) == 0;
  move_kind = MOVE_NORMAL;
  set_move_bounds(v, vdm::kMeanCurrentFloor_mA, 0);
}


// prepares a calibration stroke to the end stop; `full` if it starts at the opposite end stop
static void prepare_learn_stroke (int v, uint8_t dir, bool full) {
  isr_target = vdm::kRunToEndStop;       // max value to disable stopping
  move_req.dir = dir;
  move_req.requestedCounts = vdm::kRunToEndStop;
  move_req.expectedTravelPct = full ? 100 : 0;
  move_req.learnedTravel = learned_travel(v, dir);
  move_req.partialEarlyCheck = false;
  move_kind = MOVE_LEARN;
  set_move_bounds(v, vdm::calibrationFloor(dir), calibRetries);
}


// prepares a service move: exact pulse count, fixed threshold of maxmA
static void prepare_service_move (int v, uint8_t dir, uint16_t counts, uint8_t maxmA) {
  isr_target = counts - 1;               // the motor stops on pulse isr_target + 1
  move_req.dir = dir;
  move_req.requestedCounts = counts;
  move_req.expectedTravelPct = 0;
  move_req.learnedTravel = learned_travel(v, dir);
  move_req.partialEarlyCheck = false;
  move_kind = MOVE_SERVICE;
  move_bound_high = (int32_t) maxmA * 10;
  move_bound_low = -move_bound_high;
}


// records the move that just ended (S05)
static void finish_move (int v) {
  const uint32_t counted = isr_counter;
  const vdm::MoveClassification c = vdm::classifyMove(move_req, motor_stop_cause, counted);
  struct valve_record &rec = valve_records[v];

  move_profile.finish(counted, endstop.trip() != vdm::EndStopDetector::Trip::None ? endstop.tripCurrent() : last_turning_current);
  rec.profile = move_profile;
  rec.diag.last = vdm::makeMoveResult(move_req, c.reason, counted, endstop.peak(), millis() - move_start_ms);
  rec.diag.lastEarly = c.early;
  if (c.early && move_kind == MOVE_NORMAL) {
    if (rec.diag.earlyStops < 0xFFFF) rec.diag.earlyStops++;
    rec.diag.earlyWarn = true;
  }
  if (move_kind == MOVE_NORMAL) {
    // the second early partial stop in a row requests a calibration; the moves of a failed or
    // blocked valve never do (its calibrations come from staln and the automatic retry only)
    if ((move_flags & MOVE_KEEP_STATUS) == 0 && rec.diag.earlyRun.onMove(c.early && move_req.partialEarlyCheck))
      myvalvemots[v].earlyLearnDue = 1;
    myvalvemots[v].moveSeq++;
  }
  // the inrush limit was exceeded (reported, or the move was stopped by it)
  if (endstop.inrushSeen()) {
    myvalvemots[v].faultReason = (uint8_t) vdm::ValveFault::InrushTrip;
    myvalvemots[v].tripSeq++;
  }
  #ifdef inrushDebug
    COMM_DBG.print("inrush: valve "); COMM_DBG.print(v); COMM_DBG.print(" dir "); COMM_DBG.print(move_req.dir);
    COMM_DBG.print(" peak "); COMM_DBG.print(inrush_peak); COMM_DBG.print(" over "); COMM_DBG.println(inrush_over);
  #endif
}


// records a move the motor state machine did not start
static void record_refused_move (int v) {
  struct valve_record &rec = valve_records[v];
  rec.profile.reset();
  rec.diag.last = vdm::makeMoveResult(move_req, vdm::StopReason::Aborted, 0, 0, 0);
}


// every way out of a calibration: clears the request (calibration flag, gvlvd bit 7) and its state
static void learn_end (int v, bool success) {
  myvalvemots[v].calibration = false;
  myvalvemots[v].calibState = calibIdle;
  myvalvemots[v].calibActive = 0;
  valve_records[v].diag.lastCalFailed = !success;
  if (success) valve_records[v].diag.earlyWarn = false;
}


// a calibration stopped by sstop: not a failed calibration; the position is lost
static void learn_abort (int v) {
  myvalvemots[v].calibration = false;
  myvalvemots[v].calibState = calibIdle;
  myvalvemots[v].calibActive = 0;
  myvalvemots[v].status = VLV_STATE_IDLE;
  myvalvemots[v].needsReference = 1;
}


// the valve lost its contact: no current in a move, a calibration stroke or a service move
static void lost_contact (int v) {
  myvalvemots[v].status = VLV_STATE_OPENCIR;
  myvalvemots[v].recal = 1;
}


// a failed calibration stroke (timeout, no end stop, or the inrush limit stopped it)
static void learn_failed (int v, vdm::ValveFault fault) {
  learn_end(v, false);
  myvalvemots[v].status = VLV_STATE_FAILED;
  myvalvemots[v].faultReason = (uint8_t) fault;
}


// status after a normal move that did not fail
static byte move_status () {
  return (move_flags & MOVE_KEEP_STATUS) ? keep_status : VLV_STATE_IDLE;
}


