hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
// position after a service move: counted pulses converted with the learned scaler
static void service_move_position (int v, uint32_t counted) {
  const unsigned int scaler = myvalvemots[v].scaler;
  if (scaler == 0) return;
  const uint32_t pct = counted / scaler;
  const byte delta = (byte) (pct > 100 ? 100 : pct);
  if (move_req.dir == DIR_OPEN) myvalvemots[v].actual_position = position_add(myvalvemots[v].actual_position, delta);
  else myvalvemots[v].actual_position = position_sub(myvalvemots[v].actual_position, delta);
}


// end of a normal move (also to an end stop, the failsafe move of a blocked valve and a reference
// move); false while the motor runs
static bool end_normal_move (int v, byte result) {
  if (result == M_RES_STOP) {
    finish_move(v);
    // sstop: the position follows the pulses that really turned
    if (motor_stop_cause == vdm::MotorStop::Aborted) service_move_position(v, isr_counter);
    else if (move_req.dir == DIR_OPEN) myvalvemots[v].actual_position = position_add(myvalvemots[v].actual_position, pos_change);
    else myvalvemots[v].actual_position = position_sub(myvalvemots[v].actual_position, pos_change);
    myvalvemots[v].status = move_status();
  }
  else if (result == M_RES_NOCURRENT) {
    #ifdef motDebug
      COMM_DBG.println("A: undercurrent");
    #endif
    finish_move(v);
    lost_contact(v);
    myvalvemots[v].actual_position = myvalvemots[v].target_position;
  }
  else if (result == M_RES_ENDSTOP) {
    finish_move(v);
    // the inrush limit stopped the motor at its start: the position did not change
    if (endstop.inrushTrip()) myvalvemots[v].status = VLV_STATE_FAILED;
    else {
      // a partial move takes the position from the counted pulses, a move to the end stop 0 / 100 %
      myvalvemots[v].actual_position = vdm::positionAfterEndStop(myvalvemots[v].actual_position, move_req.dir,
        move_req.requestedCounts, isr_counter, myvalvemots[v].scaler);
      if (pos_change == 255) myvalvemots[v].needsReference = 0;
      myvalvemots[v].status = move_status();
    }
  }
  else if (result == M_RES_ERROR) {
    #ifdef motDebug
      COMM_DBG.println("A: move failed, timeout");
    #endif
    // the position is unknown: it stays as it was, app_loop reports the target as rejected (S04)
    finish_move(v);
    myvalvemots[v].status = VLV_STATE_FAILED;
    myvalvemots[v].faultReason = (uint8_t) vdm::ValveFault::MoveTimeout;
  }
  else return false;
  #ifdef motDebug
    COMM_DBG.print("A: new position "); COMM_DBG.println(myvalvemots[v].actual_position);
  #endif
  return true;
}


// starts a full calibration stroke (the valve stands at the opposite end stop)
static void start_learn_stroke (int v, uint8_t dir) {
  myvalvemots[v].status = dir == DIR_OPEN ? VLV_STATE_OPENING : VLV_STATE_CLOSING;
  prepare_learn_stroke(v, dir, true);
  motorcycle(v, dir == DIR_OPEN ? CMD_M_OPEN : CMD_M_CLOSE);
  waittimer = WAIT_TIMER20;
}


// the valve state machine went back to A_IDLE without starting the motor (sstop)
static void refuse_move (int v) {
  record_refused_move(v);
  valvestate = A_IDLE;
}


void valve_loop () {
  byte temp = 0;

  static unsigned int closing_count;
  static unsigned int opening_count;
  static uint16_t open_mean_mA;
  static uint16_t open_mean_samples;

  static int valveindex;

  static int psuofftimer;
  static int locktimer;
  static int gaptimer;
  static uint8_t gap_dir = DIR_OPEN;          // stroke after the temperature gap
  static enum ASTATE gap_next = A_LEARN3;

  static uint8_t svc_move_dir;
  static uint16_t svc_move_counts;
  static uint8_t svc_move_maxmA;
  static byte svc_prev_status;

  valve_loop_ticks++;

  if(waittimer) waittimer--;

  // the motor state machine gets a stop command while an operator stop (sstop) is pending
  const byte runcmd = stop_request ? CMD_M_STOP : 0;

  switch (valvestate) {
    case A_INIT:
                  if ( motorcycle(0, CMD_M_NOTHING) == M_RES_IDLE ) {
                     #ifdef motDebug
                        COMM_DBG.println("A: init ready");
                     #endif
                     valvestate = A_IDLE;
                     valveindex = 255;
                  }
                  break;

    case A_IDLE:
                  stop_request = false;
                  valveindex = valvenr;
                  move_flags = 0;
                  if (command == CMD_A_OPEN || command == CMD_A_CLOSE || command == CMD_A_OPEN_END || command == CMD_A_CLOSE_END) {
                    #ifdef motDebug
                      COMM_DBG.print("A: cmd "); COMM_DBG.print(command);
                      COMM_DBG.print(" for valve "); COMM_DBG.println(valveindex, 10);
                    #endif
                    valvestate = (command == CMD_A_OPEN || command == CMD_A_OPEN_END) ? A_OPEN1 : A_CLOSE1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = (command == CMD_A_OPEN || command == CMD_A_CLOSE) ? poschangecmd : 255;
                    move_flags = moveflagscmd;
                    keep_status = myvalvemots[valveindex].status;
                  }
                  else if (command == CMD_A_LEARN) {
                    #ifdef motDebug
                      COMM_DBG.print("A: cmd learn for valve ");
                      COMM_DBG.println(valveindex, 10);
                    #endif
                    valvestate = A_LEARN1;
                    PSU_ON();
                    psuofftimer = 0;
                    waittimer = WAIT_TIMER50;
                    calibRetries = 0;
                    myvalvemots[valveindex].calibRetries=0;
                    myvalvemots[valveindex].calibActive = 1;
                  }
                  else if (command == CMD_A_TEST) {
                    #ifdef motDebug
                      COMM_DBG.print("A: cmd test valve ");
                      COMM_DBG.println(valveindex, 10);
                    #endif
                    valvestate = A_TEST;
                    PSU_ON();
                    waittimer = WAIT_TIMER100;
                    psuofftimer = 0;
                  }
                  else if (command == CMD_A_SERVICE) {
                    #ifdef motDebug
                      COMM_DBG.print("A: cmd service move for valve ");
                      COMM_DBG.println(valveindex, 10);
                    #endif
                    valvestate = A_SVC1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    svc_move_dir = svc_dir;
                    svc_move_counts = svc_counts;
                    svc_move_maxmA = svc_maxmA;
                  }
                  else {
                    valvestate = A_IDLE;

                    // switch off PSU after some inactive (idle) time
                    psuofftimer++;
                    if(psuofftimer > 1500) {      // 15 s
                      psuofftimer = 0;
                      PSU_OFF();
                      MUX_OFF();
                    }
                  }

                  // decrement learning counter
                  if (!myvalvemots[valveindex].calibration) {
                    if(valvestate == A_OPEN1 || valvestate == A_CLOSE1) {
                      if(myvalves[valveindex].learn_movements) {
                        myvalves[valveindex].learn_movements--;
                      }
                      myvalves[valveindex].movements++;
                    }
                  }

                  // pause temperature measurement to avoid ADC interference
                  if(valvestate != A_IDLE) {
                    temp_command(TEMP_CMD_LOCK);
                    locktimer = 0;
                  }
                  else {
                    if (locktimer<50) locktimer++;
                    else temp_command(TEMP_CMD_UNLOCK);
                  }

                  command = '\0';       // clear command for next loop call, prevents reevaluating
                  break;

