hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
    case A_OPEN1:  // start valve opening
    case A_CLOSE1: // start valve closing
                  {
                    const bool open = valvestate == A_OPEN1;
                    if (stop_request) {
                      prepare_normal_move(valveindex, open ? DIR_OPEN : DIR_CLOSE, pos_change);
                      refuse_move(valveindex);
                    }
                    else if (!waittimer) {
                      prepare_normal_move(valveindex, open ? DIR_OPEN : DIR_CLOSE, pos_change);
                      if (motorcycle (valveindex, open ? CMD_M_OPEN : CMD_M_CLOSE) == (open ? M_RES_OPENS : M_RES_CLOSES)) {
                        #ifdef motDebug
                          COMM_DBG.print("A: begin move by ");
                          COMM_DBG.println(pos_change);
                        #endif
                        // a failed or blocked valve keeps its status also while it moves
                        if ((move_flags & MOVE_KEEP_STATUS) == 0) myvalvemots[valveindex].status = open ? VLV_STATE_OPENING : VLV_STATE_CLOSING;
                        valvestate = open ? A_OPEN2 : A_CLOSE2;
                      }
                      else {
                        #ifdef motDebug
                          COMM_DBG.print("A: cant move valve");
                        #endif
                        refuse_move(valveindex);
                      }
                    }
                  }
                  break;

    case A_OPEN2:  // wait for the end of the move
    case A_CLOSE2:
                  if (end_normal_move(valveindex, motorcycle (valveindex, runcmd))) valvestate = A_IDLE;
                  break;

    case A_LEARN1:  // prepare learning
                  #ifdef motDebug
                    COMM_DBG.println("A: try learning valve");
                  #endif
                  if (stop_request) {
                    learn_abort(valveindex);
                    refuse_move(valveindex);
                    break;
                  }
                  // first: closing completely
                  prepare_learn_stroke(valveindex, DIR_CLOSE, false);
                  motorcycle (valveindex, CMD_M_CLOSE);
                  myvalvemots[valveindex].status = VLV_STATE_CLOSING;
                  valvestate = A_LEARN2;
                  waittimer = WAIT_TIMER20;
                  break;

    case A_LEARN2:  // goto start position
    case A_LEARN3:  // learning opening way
    case A_LEARN4:  // learning closing way
                  if (!waittimer) {
                    temp = motorcycle (valveindex, runcmd);
                    if (temp == M_RES_STOP && motor_stop_cause == vdm::MotorStop::Aborted && stop_request) {
                      // sstop: the calibration ends without a result, the position is lost
                      finish_move(valveindex);
                      learn_abort(valveindex);
                      valvestate = A_IDLE;
                    }
                    else if (temp == M_RES_ENDSTOP && endstop.inrushTrip()) {
                      // never calibration evidence: no counts, no BLOCKS
                      finish_move(valveindex);
                      learn_failed(valveindex, vdm::ValveFault::InrushTrip);
                      valvestate = A_IDLE;
                    }
                    else if (temp == M_RES_ENDSTOP && valvestate == A_LEARN2) {
                      #ifdef motDebug
                        COMM_DBG.println("A: closed valve before learning, now opening");
                      #endif
                      finish_move(valveindex);
                      // second: opening completely and count rotations
                      gap_dir = DIR_OPEN;
                      gap_next = A_LEARN3;
                    }
                    else if (temp == M_RES_ENDSTOP && valvestate == A_LEARN3) {
                      #ifdef motDebug
                        COMM_DBG.println("A: opened valve for learning, now closing again");
                      #endif
                      finish_move(valveindex);
                      opening_count = isr_counter;
                      // kept until the pass is accepted (S02)
                      open_mean_mA = stroke_mean_mA;
                      open_mean_samples = stroke_mean_samples;
                      // third: closing completely and count rotations, threshold from the learned mean current
                      // but not below the 1.x closing threshold (S01)
                      gap_dir = DIR_CLOSE;
                      gap_next = A_LEARN4;
                    }
                    else if (temp == M_RES_ENDSTOP) {
                      #ifdef motDebug
                        COMM_DBG.println("A: closed valve for learning");
                      #endif
                      finish_move(valveindex);
                      closing_count = isr_counter;
                      myvalvemots[valveindex].actual_position = 0;    // because valve was closed completely

                      const vdm::CalibrationVerdict verdict =
                        vdm::evaluateCalibration(opening_count, closing_count, noOfMinCounts, calibRetries, maxCalibRetries);
                      #ifdef motDebug
                        COMM_DBG.print("A: counts open/close/min = "); COMM_DBG.print(opening_count);
                        COMM_DBG.print(" "); COMM_DBG.print(closing_count);
                        COMM_DBG.print(" "); COMM_DBG.println(noOfMinCounts);
                      #endif

                      if (verdict == vdm::CalibrationVerdict::Accept) {
                        // only a successful pass changes the learned values (S02, S03)
                        myvalvemots[valveindex].meancurrent = vdm::learnMeanCurrent((uint16_t) myvalvemots[valveindex].meancurrent,
                          open_mean_mA, open_mean_samples, stroke_mean_mA, stroke_mean_samples);
                        myvalvemots[valveindex].closing_count = closing_count;
                        myvalvemots[valveindex].opening_count = opening_count;
                        myvalvemots[valveindex].deadzone_count = (int) closing_count - (int) opening_count;
                        myvalvemots[valveindex].scaler = opening_count / 100;
                        myvalvemots[valveindex].status = VLV_STATE_IDLE;
                        myvalvemots[valveindex].calibrated = 1;
                        myvalvemots[valveindex].recal = 0;
                        myvalvemots[valveindex].needsReference = 0;
                        myvalvemots[valveindex].calibFailed = 0;
                        myvalvemots[valveindex].faultReason = (uint8_t) vdm::ValveFault::None;
                        myvalvemots[valveindex].calibSeq++;
                        valve_records[valveindex].diag.lastCalFailed = false;
                        valve_records[valveindex].diag.earlyWarn = false;
                        valve_records[valveindex].diag.earlyRun.reset();
                        // the movement trigger counts from this calibration (S14)
                        myvalves[valveindex].movements = 0;
                        myvalves[valveindex].learn_movements = learning_movements;
                        #ifdef motDebug
                          COMM_DBG.print("A: learned scaler = "); COMM_DBG.println(myvalvemots[valveindex].scaler);
                          COMM_DBG.print("A: learned mean current = "); COMM_DBG.println(myvalvemots[valveindex].meancurrent);
                        #endif
                        valvestate = A_SET;
                      }
                      else {
                        calibRetries++;
                        if (myvalvemots[valveindex].calibRetries < 255) myvalvemots[valveindex].calibRetries++;

