hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
                        if (verdict == vdm::CalibrationVerdict::Retry) {
                          valvestate = A_LEARN1;
                          PSU_ON();
                          psuofftimer = 0;
                          waittimer = WAIT_TIMER50;
                          #ifdef motDebug
                            COMM_DBG.print("A: calibration retry  = "); COMM_DBG.println(calibRetries);
                          #endif
                        }
                        else {
                          // BLOCKS sticks: no positioning with the counts of a failed pass (S03)
                          myvalvemots[valveindex].status = VLV_STATE_BLOCKS;
                          myvalvemots[valveindex].faultReason = (uint8_t) vdm::ValveFault::StrokesTooShort;
                          myvalvemots[valveindex].calibFailed = 1;
                          myvalvemots[valveindex].calibSeq++;
                          learn_end(valveindex, false);
                          valveindex = 255;
                          valvestate = A_IDLE;
                          #ifdef motDebug
                            COMM_DBG.println("A: calibration failed, valve blocked");
                          #endif
                        }
                      }
                    }
                    else if (temp == M_RES_NOCURRENT) {
                      #ifdef motDebug
                        COMM_DBG.println("A: (A_LEARN) undercurrent");
                      #endif
                      finish_move(valveindex);
                      lost_contact(valveindex);
                      // the target stays: the valve goes there once it is found again (S2)
                      myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                      learn_end(valveindex, false);
                      valvestate = A_IDLE;
                    }
                    // stop: the counter ran out (isr_target 65535) without an end stop, idle: motor machine not running
                    else if (temp == M_RES_ERROR || temp == M_RES_STOP || temp == M_RES_IDLE) {
                      #ifdef motDebug
                        COMM_DBG.println("A: calibration stroke failed, timeout");
                      #endif
                      if (temp != M_RES_IDLE) finish_move(valveindex);
                      learn_failed(valveindex, vdm::ValveFault::StrokeTimeout);
                      valvestate = A_IDLE;
                    }

                    // between two strokes (motor stopped at an end stop): a due temperature cycle first (S1)
                    if (valvestate == A_LEARN2 || valvestate == A_LEARN3) {
                      if (temp == M_RES_ENDSTOP) {
                        if (temp_refresh_request) {
                          temp_command(TEMP_CMD_UNLOCK);
                          gaptimer = 0;
                          valvestate = A_GAP;
                        }
                        else {
                          start_learn_stroke(valveindex, gap_dir);
                          valvestate = gap_next;
                        }
                      }
                    }
                  }
                  break;

    case A_GAP:   // pause between two calibration strokes for a temperature cycle
                  if (stop_request) {
                    temp_command(TEMP_CMD_LOCK);
                    learn_abort(valveindex);
                    valvestate = A_IDLE;
                  }
                  else if (!temp_refresh_request || ++gaptimer >= TIMEOUT_TEMPGAP) {
                    // app_loop ends this period, the next pause comes 60 s later
                    if (temp_refresh_request) temp_gap_timeout = true;
                    temp_command(TEMP_CMD_LOCK);
                    start_learn_stroke(valveindex, gap_dir);
                    valvestate = gap_next;
                  }
                  break;

     case A_SET:  // set to previous %
                  valveindex = valvenr;
                  #ifdef motDebug
                      COMM_DBG.print("A_SET: set position "); COMM_DBG.println(myvalvemots[valveindex].target_position);
                  #endif
                  myvalvemots[valveindex].actual_position=0;
                  if (myvalvemots[valveindex].target_position==0) {
                      learn_end(valveindex, true);
                      valveindex = 255;
                      valvestate = A_IDLE;
                  } else {
                    valvestate = A_SET1;
                    PSU_ON();
                    waittimer = WAIT_TIMER50;
                    psuofftimer = 0;
                    pos_change = myvalvemots[valveindex].target_position;
                  }
                  break;

     case A_SET1:  // start valve opening
                  if (stop_request) {
                    prepare_normal_move(valveindex, DIR_OPEN, pos_change);
                    learn_end(valveindex, true);
                    refuse_move(valveindex);
                  }
                  else if (!waittimer) {
                    prepare_normal_move(valveindex, DIR_OPEN, pos_change);

                    if (motorcycle (valveindex, CMD_M_OPEN) == M_RES_OPENS) {
                      #ifdef motDebug
                        COMM_DBG.print("A_SET1: begin opening by ");
                        COMM_DBG.println(pos_change);
                      #endif
                      myvalvemots[valveindex].status = VLV_STATE_OPENING;
                      valvestate = A_SET2;
                    }
                    else {
                      #ifdef motDebug
                        COMM_DBG.print("A_SET1: cant open valve");
                      #endif
                      record_refused_move(valveindex);
                      learn_end(valveindex, true);
                      valvestate = A_IDLE;
                    }
                  }
                  break;

    case A_SET2:  // wait for finish opening: the calibration already succeeded
                  if (end_normal_move(valveindex, motorcycle (valveindex, runcmd))) {
                    learn_end(valveindex, true);
                    valvestate = A_IDLE;
                  }
                  break;

     case A_TEST:  // test if a valve is connected
                  if (!waittimer) {

