hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
                    temp = motorcycle (valveindex, CMD_M_TEST);
                    if (temp != M_RES_TEST) {
                      const vdm::PresenceTest::Result result = temp == M_RES_NOCURRENT ? vdm::PresenceTest::Result::Absent
                        : temp == M_RES_ERROR ? vdm::PresenceTest::Result::Short : vdm::PresenceTest::Result::Present;
                      const vdm::PresenceOutcome outcome = vdm::presenceOutcome(result, myvalvemots[valveindex].calibrated,
                                                                                myvalvemots[valveindex].recal);
                      #ifdef motDebug
                        COMM_DBG.print("A: (A_TEST) test valve ");
                        COMM_DBG.print(valveindex, DEC);
                        COMM_DBG.print(" --> status ");
                        COMM_DBG.println(outcome.status, DEC);
                      #endif
                      myvalvemots[valveindex].status = outcome.status;
                      myvalvemots[valveindex].faultReason = outcome.fault;
                      if (outcome.needsReference) myvalvemots[valveindex].needsReference = 1;
                      // no contact: the valve is tested again at its next target change (S2)
                      if (result == vdm::PresenceTest::Result::Absent)
                        myvalvemots[valveindex].actual_position = myvalvemots[valveindex].target_position;
                      // a short (enforced or only reported)
                      if (test_presence.shortSeen()) {
                        myvalvemots[valveindex].faultReason = (uint8_t) vdm::ValveFault::Short;
                        myvalvemots[valveindex].tripSeq++;
                      }
                      valvestate = A_IDLE;
                    }
                  }
                  break;

    case A_SVC1:  // start service move (F03)
                  if (stop_request) {
                    prepare_service_move(valveindex, svc_move_dir, svc_move_counts, svc_move_maxmA);
                    refuse_move(valveindex);
                  }
                  else if (!waittimer) {
                    prepare_service_move(valveindex, svc_move_dir, svc_move_counts, svc_move_maxmA);
                    svc_prev_status = myvalvemots[valveindex].status;

                    if (motorcycle (valveindex, svc_move_dir == DIR_OPEN ? CMD_M_OPEN : CMD_M_CLOSE) ==
                        (svc_move_dir == DIR_OPEN ? M_RES_OPENS : M_RES_CLOSES)) {
                      myvalvemots[valveindex].status = svc_move_dir == DIR_OPEN ? VLV_STATE_OPENING : VLV_STATE_CLOSING;
                      valvestate = A_SVC2;
                    }
                    else {
                      record_refused_move(valveindex);
                      // nothing moved: app_loop may correct the position again
                      myvalves[valveindex].svcHold = 0;
                      valvestate = A_IDLE;
                    }
                  }
                  break;

    case A_SVC2:  // wait for the end of the service move
                  temp = motorcycle (valveindex, runcmd);
                  if (temp == M_RES_STOP || temp == M_RES_ENDSTOP || temp == M_RES_NOCURRENT || temp == M_RES_ERROR) {
                    finish_move(valveindex);
                    // the pulses really turned: the position follows them, also after a threshold stop
                    service_move_position(valveindex, isr_counter);
                    if (temp == M_RES_NOCURRENT) myvalvemots[valveindex].recal = 1;
                    // a fault or a pending request stays until a calibration clears it
                    if (svc_prev_status != VLV_STATE_IDLE) myvalvemots[valveindex].status = svc_prev_status;
                    else if (temp == M_RES_NOCURRENT) myvalvemots[valveindex].status = VLV_STATE_OPENCIR;
                    else if (temp == M_RES_ERROR) {
                      myvalvemots[valveindex].status = VLV_STATE_FAILED;
                      myvalvemots[valveindex].faultReason = (uint8_t) vdm::ValveFault::MoveTimeout;
                    }
                    else myvalvemots[valveindex].status = VLV_STATE_IDLE;
                    // the inrush limit stopped the motor at its start (fault 5, set by finish_move)
                    if (temp == M_RES_ENDSTOP && endstop.inrushTrip()) myvalvemots[valveindex].status = VLV_STATE_FAILED;
                    valvestate = A_IDLE;
                  }
                  break;


    default:      valvestate = A_IDLE;
                  break;
  }
  if (valveindex<12) myvalvemots[valveindex].connected= (myvalvemots[valveindex].status != VLV_STATE_OPENCIR);

  // a valve state that never ends stops feeding the watchdog (see loop_system)
  valve_stall.tick((uint8_t) valvestate, valvestate == A_IDLE);
  valve_loop_stalled = valve_stall.stalled();
}


byte motorcycle (int mvalvenr, byte cmd) {
  #define M_INIT      0
  #define M_IDLE      1
  #define M_OPEN      2
  #define M_CLOSE     3
  #define M_TURNING   4
  #define M_TURNON    8
  #define M_STOP      5
  #define M_UNDERCURR 7
  #define M_TESTPREP  9
  #define M_TEST      10
  #define M_SETTLE    11      // wait for the MUX relay after set_motor()
  #define M_START     12      // start motor after M_SETTLE (open/close)
  #define M_TESTSTART 13      // start motor after M_SETTLE (test)

  static byte motorstate = M_INIT;
  static byte settle_next = M_IDLE;
  static byte settle_result = M_RES_TURNING;
  static int settlecnt;
  static int turnoncnt;

  static int cyclecnt;
  static int debouncecnt;

  static int normalcurrcnt;

  static uint16_t meancurrent_cnt;              // counts meancurrent values
  static long meancurrent_mem;                  // memory for meancurrent values
  byte result = 0;

  // target count reached (flag set by the EXTI handler, which must not run this state machine itself)
  if (isr_stop_request) {
    isr_stop_request = 0;
    if (motorstate == M_TURNON || motorstate == M_TURNING) {
      motorstate = M_STOP;
      motor_stop_cause = vdm::MotorStop::CountReached;
    }
  }

    switch (motorstate) {
      case M_INIT:  MUX_OFF();         // relay MUX off
                    ena_all_off();
                    DIR_OFF();         // direction off
  
                    motorstate = M_IDLE;
                    isr_turning = 0;
                    result = M_RES_INIT;
  
                    break;
  
      case M_IDLE:
                    if (cmd == CMD_M_OPEN) {
                      motorstate = M_OPEN;  
                      result = M_RES_OPENS;
                    }
                    else if (cmd == CMD_M_CLOSE) {
                      motorstate = M_CLOSE;  
                      result = M_RES_CLOSES;
                    }
                    else if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;
                      result = M_RES_STOP;  
                    }
                    else if (cmd == CMD_M_TEST) {
                      motorstate = M_TESTPREP;
                      result = M_RES_TEST;  
                    }
                    else {
                      motorstate = M_IDLE;  
                      result = M_RES_IDLE;
                    }
  
                    // correct motor nr?
                    if (motorstate != M_IDLE && (mvalvenr < 0 || mvalvenr >= (int) ACTUATOR_COUNT)) {
                      motorstate = M_IDLE;
                      result = M_RES_IDLE;
                    }

                    
                    break;
      
      case M_OPEN:  
                    #ifdef motDebug
                      COMM_DBG.println("M: state open");                                  
                    #endif
                    set_motor(mvalvenr, DIR_OPEN);
                    settlecnt = MUX_SETTLE_TICKS;
                    settle_next = M_START;
                    settle_result = M_RES_TURNING;
                    motorstate = M_SETTLE;
                    result = M_RES_OPENS;
                    break;
                    
