hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
      case M_CLOSE:
                    #ifdef motDebug
                      COMM_DBG.println("M: state close");                                 
                    #endif
                    set_motor(mvalvenr, DIR_CLOSE);
                    settlecnt = MUX_SETTLE_TICKS;
                    settle_next = M_START;
                    settle_result = M_RES_TURNING;
                    motorstate = M_SETTLE;
                    result = M_RES_CLOSES;
                    break;

      case M_SETTLE:
                    if (settlecnt > 0) settlecnt--;
                    if (settlecnt == 0) motorstate = settle_next;
                    result = settle_result;
                    break;

      case M_START:
                    motorstate = M_TURNON;
                    isr_valvenr = mvalvenr;
                    isr_counter=0;
                    cyclecnt = 0;
                    debouncecnt = 0;
                    isr_stop_request = 0;
                    isr_overcurrentevent = 0;     // may be left over from the previous move
                    isr_timer_go = 0;             // soft start handshake with TimerHandler0 starts from scratch
                    isr_timer_fin = 0;
                    turnoncnt = 0;
                    // isr_turning is still 0: TimerHandler0 does not sample before the motor is switched on
                    endstop.arm(move_bound_low, move_bound_high, protect_suspended ? vdm::EndStopDetector::InrushMode::Off
                      : protect_enforce ? vdm::EndStopDetector::InrushMode::Enforce : vdm::EndStopDetector::InrushMode::Report);
                    #ifdef inrushDebug
                      inrush_samples = 0;
                      inrush_peak = 0;
                      inrush_over = 0;
                    #endif
                    move_profile.reset();
                    motor_stop_cause = vdm::MotorStop::None;
                    last_turning_current = 0;
                    move_start_ms = millis();
                    result = M_RES_TURNING;
                    attachInterrupt(digitalPinToInterrupt(REVINPIN), isr_count, RISING);
                    break;
                  
      case M_TURNON:
                    isr_turning = 1;
                    result = M_RES_TURNING;
                    isr_timer_go = 1;

                    meancurrent_mem = 0;
                    meancurrent_cnt = 0;

                    analog_current_old = 0;
                    undercurrcnt = 0;
                    normalcurrcnt = 0;

                    // check if pwm is finished
                    if(isr_timer_fin) {
                      motorstate = M_TURNING;
                      isr_timer_fin = 0;
                      isr_timer_go = 0;
                    }
                    // TimerHandler0 (TIM1) did not enable the motor
                    else if (++turnoncnt > TIMEOUT_TURNON) {
                      #ifdef motDebug
                        COMM_DBG.println("M: motor enable timeout");
                      #endif
                      motor_halt();
                      motor_stop_cause = vdm::MotorStop::Aborted;
                      motorstate = M_IDLE;
                      result = M_RES_ERROR;
                    }

                    break;

      case M_TURNING:
                    result = M_RES_TURNING;
    
                    if (cmd == CMD_M_STOP) {
                      motorstate = M_STOP;  
                    }
                    cyclecnt++;
                                
                    if(debouncecnt<255) debouncecnt++;

                    last_turning_current = current_mA;
                    move_profile.add(isr_counter, last_turning_current);

                    if (debouncecnt > 3) {                      
                      // overcurrent detection
                      if(isr_overcurrentevent)         
                      {                                         
                          motor_halt();
                          motorstate = M_IDLE;
                          result = M_RES_ENDSTOP;
                          isr_overcurrentevent = 0;
                          motor_stop_cause = endstop.trip() == vdm::EndStopDetector::Trip::Bound
                            ? vdm::MotorStop::EndStop : vdm::MotorStop::SafetyOvercurrent;

                          stroke_mean_mA = vdm::strokeMeanCurrent((int32_t) meancurrent_mem, meancurrent_cnt);
                          stroke_mean_samples = meancurrent_cnt;
                          #ifdef motDebug
                            COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                            COMM_DBG.print("M: Cnt:     "); COMM_DBG.println(isr_counter, DEC);                                 
                            COMM_DBG.println("M: Autostop, reached end stop");
                          #endif
                      }

                       // under current detection
                      else if(current_mA < THRESHOLD_UNDERCURRENT && current_mA > -THRESHOLD_UNDERCURRENT) 
                      { 
                        undercurrcnt++;
                        #ifdef motDebug
                            COMM_DBG.print("M: (M_TURNING) under current detection: undercurrcnt="); 
                            COMM_DBG.print(undercurrcnt); 
                            COMM_DBG.print(" current=");
                            COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA");
                        #endif
                    
                        if (undercurrcnt > TIMEOUT_UNDERCURRENT)
                        {
                          #ifdef motDebug
                            COMM_DBG.print("M: (M_TURNING) under current detected: undercurrcnt="); 
                            COMM_DBG.print(undercurrcnt); 
                            COMM_DBG.print(" current=");
                            COMM_DBG.print(current_mA/10,10); COMM_DBG.println(" mA. set motorstate to  M_UNDERCURR");
                          #endif
                          motorstate = M_UNDERCURR;
                        }                        
                      }

                      // normal turning
                      else  {
                        normalcurrcnt++;
                        if(normalcurrcnt > TIMEOUT_NORMALCURRENT) {
                          #ifdef motDebug          
                            COMM_DBG.println("M: normal turning timeout");            
                          #endif
                          motor_halt();
                          motor_stop_cause = vdm::MotorStop::Timeout;
                          motorstate = M_IDLE;
                          result = M_RES_ERROR;
                        }                
                      }
                    
