hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
                      // output position and current
                        #ifdef motDebugPosAndCurrent
                          COMM_DBG.print("tm;"); 
                          COMM_DBG.print(current_mA,10); 
                          COMM_DBG.print(";"); 
                          COMM_DBG.println(isr_counter);
                        #endif
                    }

                    if (debouncecnt > 50 && cyclecnt > 50) {
                      cyclecnt=0;
                      #ifdef motDebug
                        COMM_DBG.print("M: Current: "); COMM_DBG.print(current_mA/10, 10); COMM_DBG.println(" mA");
                      #endif
                      meancurrent_mem += current_mA;
                      if (meancurrent_cnt < 0xFFFF) meancurrent_cnt++;
                    }
                    break;
                      
      case M_STOP:         
                    #ifdef motDebug
                      COMM_DBG.println("M: state stop");    
                    #endif                                  
                    motor_halt();
                    if (motor_stop_cause == vdm::MotorStop::None) motor_stop_cause = vdm::MotorStop::Aborted;
                    #ifdef motDebug
                      COMM_DBG.print("M: Cnt: ");  
                      COMM_DBG.println(isr_counter, DEC);                                 
                    #endif
                    motorstate = M_IDLE;
                    result = M_RES_STOP;                  
                    
                    break;

      case M_UNDERCURR:         
                    motor_halt();
                    motor_stop_cause = vdm::MotorStop::Undercurrent;
                    #ifdef motDebug
                      COMM_DBG.println("M: state undercurrent detected (M_UNDERCURR), stopped");    
                    #endif                                  
                    motorstate = M_IDLE;
                    result = M_RES_NOCURRENT;                  
                    
                    break;

      case M_TESTPREP:
                    #ifdef motDebug
                      COMM_DBG.println("M: test prep");                                  
                    #endif
                    set_motor(mvalvenr, DIR_OPEN); 
                    settlecnt = MUX_SETTLE_TICKS;
                    settle_next = M_TESTSTART;
                    settle_result = M_RES_TEST;
                    motorstate = M_SETTLE;
                    result = M_RES_TEST;
                    break;

      case M_TESTSTART:
                    isr_overcurrentevent = 0;     // may be left over from the previous move
                    ena_motor(mvalvenr, 1);                 
                
                    test_presence.start(!protect_suspended, protect_enforce);

                    analog_current_old = 0;
                    analog_current = 0;

                    motorstate = M_TEST;
                    result = M_RES_TEST;                    

                    break;

      case M_TEST:
                    // open circuit, motor present or short, from the filtered test current (vdm::PresenceTest)
                    result = M_RES_TEST;
                    switch (test_presence.sample(analog_current)) {
                      case vdm::PresenceTest::Result::Absent:
                        result = M_RES_NOCURRENT;
                        break;
                      case vdm::PresenceTest::Result::Present:
                        result = M_RES_OPENS;
                        break;
                      case vdm::PresenceTest::Result::Short:
                        result = M_RES_ERROR;
                        break;
                      default:
                        break;
                    }
                    if (result != M_RES_TEST) {
                      #ifdef motDebug
                        COMM_DBG.print("test: result "); COMM_DBG.println(result);
                      #endif
                      motorstate = M_IDLE;
                      ena_all_off();
                    }
                    break;

      default:      motorstate = M_IDLE;
                    result = M_RES_IDLE;
                    break;
    }  

  return result;
}


// sets direction and mux relay
// the relay needs WAIT_MUX ms to settle before the motor is enabled, motorcycle() waits in M_SETTLE
void set_motor (int smvalvenr, int dir) {

  if (smvalvenr % 2) { MUX_OFF(); }
  else { MUX_ON(); }
  
  if (dir == DIR_OPEN) { DIR_OFF(); } 
  else { DIR_ON(); }
}


// all motor enables off
static void ena_all_off () {
  ENA0_OFF(); ENA1_OFF(); ENA2_OFF(); ENA3_OFF(); ENA4_OFF(); ENA5_OFF();
}


// enables motor 
void ena_motor (int emvalvenr, int state) {

  if (state == 0) { 
    ena_all_off();
  }
  else {
    if (emvalvenr == 0 || emvalvenr == 1) { ENA0_ON(); }
    else if (emvalvenr == 2 || emvalvenr == 3) { ENA1_ON(); }
    else if (emvalvenr == 4 || emvalvenr == 5) { ENA2_ON(); }
    else if (emvalvenr == 6 || emvalvenr == 7) { ENA3_ON(); }
    else if (emvalvenr == 8 || emvalvenr == 9) { ENA4_ON(); }
    else if (emvalvenr == 10 || emvalvenr == 11) { ENA5_ON(); }
  }
}


void isr_count () {
  if (isr_turning) isr_counter++;
  if (isr_target > 0) isr_target--;
  else callback_motorstop();
}


// switches the motor off and cancels a soft start that TimerHandler0 has not done yet;
// called by the motor state machine (TIM2)
static void motor_halt () {
  detachInterrupt(digitalPinToInterrupt(REVINPIN));
  isr_turning = 0;
  isr_timer_go = 0;       // before fin: TimerHandler0 enables the motor on go && !fin
  isr_timer_fin = 0;
  ena_all_off();
}


// call from isr to stop motor immediately
// the state machine picks the stop up on its next run (TIM2), it is not reentrant
void callback_motorstop () {
  detachInterrupt(digitalPinToInterrupt(REVINPIN));
  isr_turning = 0;
  ena_all_off();
  isr_stop_request = 1;
}


// returns state of application  state machine
enum ASTATE valve_getstate () {
  return valvestate;
}


// the valve state machine is idle and no command is pending: no valve moves until the main loop
// hands over the next command, so until then the main loop may change the state of any valve
bool valve_idle () {
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  const bool idle = valvestate == A_IDLE && command == '\0';
  __set_PRIMASK(primask);
  return idle;
}


int16_t appsetaction(char cmd, unsigned int valveindex, byte posdelta, bool force, uint8_t flags) {
  bool accepted = false;

  if (valveindex < ACTUATOR_COUNT) {
    // valve_loop (TIM2) must see valve, position and command as one consistent set
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();
    // a command accepted earlier but not yet taken by valve_loop must not be overwritten
    if ((valvestate == A_IDLE && command == '\0') || force) {
      valvenr = (int) valveindex;
      poschangecmd = posdelta;
      moveflagscmd = flags;
      // from here on the kept position of the valve is not valid (warm reset in the move)
      app_warm_moving(valveindex);
      command = cmd;              // last: valve_loop acts on the command
      accepted = true;
    }
    __set_PRIMASK(primask);
  }

  if (accepted) return 0;
  else {
    #ifdef motDebug          
      COMM_DBG.print("command rejected, state: ");
      COMM_DBG.println(valvestate, DEC);            
    #endif
    return -1;
  }
}


int16_t appsetservice(unsigned int valveindex, uint8_t dir, uint16_t counts, uint8_t maxmA) {
  bool accepted = false;

