hubertciebiada/VdMot_Controller/software_stm32/src/motor.cpp
  if (valveindex >= ACTUATOR_COUNT || dir > DIR_CLOSE || counts < SVMOV_COUNTS_MIN || counts > SVMOV_COUNTS_MAX
      || maxmA < SVMOV_MAXMA_MIN || maxmA > SVMOV_MAXMA_MAX) return -1;

  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  if (valvestate == A_IDLE && command == '\0') {
    svc_dir = dir;
    svc_counts = counts;
    svc_maxmA = maxmA;
    valvenr = (int) valveindex;
    // the valve is left where the move puts it; set before the command, as a refused start clears it
    myvalves[valveindex].svcHold = SVMOV_HOLD_10S;
    app_warm_moving(valveindex);
    command = CMD_A_SERVICE;      // last: valve_loop acts on the command
    accepted = true;
  }
  __set_PRIMASK(primask);

  return accepted ? 0 : -2;
}


int16_t appstop(unsigned int valve) {
  int16_t stopped = -1;
  const bool any = valve == 255;
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  if (command != '\0' && (any || valvenr == (int) valve)) {
    // handed over but not taken yet: the command is dropped
    command = '\0';
    stopped = (int16_t) valvenr;
  }
  else if (valvestate != A_IDLE && valvestate != A_INIT && (any || valvenr == (int) valve)) {
    // the waiting states stop the motor; the request ends when the machine is back in A_IDLE
    stop_request = true;
    stopped = (int16_t) valvenr;
  }
  __set_PRIMASK(primask);
  return stopped;
}


int valve_busy_index () {
  const uint32_t primask = __get_PRIMASK();
  __disable_irq();
  const int busy = (valvestate == A_IDLE || valvestate == A_INIT) && command == '\0' ? -1 : valvenr;
  __set_PRIMASK(primask);
  return busy;
}


void TimerHandler0()        // called every 1 ms
{
  int analog_value;                     // current valve motor in 1/10 mA read by analog pin

  // current measurement
  analog_value = (int) ((( (int32_t) analogRead(ANINCURRENT) - (int32_t) analogRead(ANINREFHALF)) * ANINCURRENTGAIN) / 100);

  // filter test mode
  analog_current = (int) (((int32_t) analog_current_old * 9800 + (int32_t) analog_value * 200) / 10000);
  analog_current_old = analog_current;

  if(isr_turning) {
    #ifdef inrushDebug
      if (inrush_samples < 50) {
        inrush_samples++;
        const int32_t magnitude = analog_value < 0 ? -analog_value : analog_value;
        if (magnitude > inrush_peak) inrush_peak = magnitude;
        if (magnitude > vdm::EndStopDetector::kInrushLimit) inrush_over++;
      }
    #endif
    // inrush time, filter, end-stop bounds, safety and hard limit (EndStopDetector)
    const bool trip = endstop.sample(analog_value) != vdm::EndStopDetector::Trip::None;
    current_mA = endstop.current();

    if (trip) {
      // stop motor immediately
      detachInterrupt(digitalPinToInterrupt(REVINPIN));                           
      ena_all_off();
      isr_turning = 0;
      isr_overcurrentevent = 1;
    }
  }
  else {
    endstop.idle();
    current_mA = 0;
  } 

  // ENA valve (soft start requested by M_TURNON and not cancelled since)
  if(isr_turning && isr_timer_go && !isr_timer_fin) {
    isr_timer_fin = 1;
    ena_motor(isr_valvenr, 1);
  }
}
